InformationRegisters/СостоянияСинхронизацииОбъектовСЦентромЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияСинхронизацииОбъектовСЦентромЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеткаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСинхронизацииСЦентромЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиИнтеграцииЦентраЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииЦентраЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьЦентраЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЦентровЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяЗавершитьПереходВЦентрЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСинхронизацииСЦентромЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСинхронизацииСЦентромЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументыЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетныеЗаписиЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеДокументовЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусыДоверенностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортныеКонтейнерыЭДО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СостоянияСинхронизацииОбъектовСЦентромЭДО/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ТолькоИзменение Тогда
		ТолькоИзменение = Истина;
		Элементы.Список.ИзменятьСоставСтрок = Ложь;
		Элементы.Список.ИзменятьПорядокСтрок = Ложь;
	КонецЕсли;
	
	Если Параметры.ПолучатьДанныеИзСервиса Тогда
		Элементы.МеткаВремениВЦентреЭДО.Видимость = Истина;
		Элементы.ФормаПолучитьИзОблака.Видимость = Истина;
		Элементы.СписокПолучитьИзОблака.Видимость = Истина;
		Элементы.Список.УстановитьДействие("ПриПолученииДанныхНаСервере",
			"Подключаемый_СписокПриПолученииДанныхНаСервере");
	Иначе
		Элементы.МеткаВремениВЦентреЭДО.Видимость = Ложь;
		Элементы.ФормаПолучитьИзОблака.Видимость = Ложь;
		Элементы.СписокПолучитьИзОблака.Видимость = Ложь;
	КонецЕсли;
	
	ТипДанных = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.Отбор, "ТипДанных");
	Если ЗначениеЗаполнено(ТипДанных) Тогда
		УстановитьЗаголовокПоТипуДанных(ТипДанных);
		Элементы.ТипДанных.Видимость = Ложь;
	КонецЕсли;
	
	ИдентификаторЭДО = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.Отбор, "ИдентификаторЭДО");
	Если ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		Элементы.ИдентификаторЭДО.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ВыбраннаяСтрока);
	ПараметрыФормы.Вставить("ТолькоИзменение", ТолькоИзменение);
	Если ТекущиеДанные.Свойство("МеткаВремениВЦентреЭДО") Тогда
		ПараметрыФормы.Вставить("МеткаВремениВЦентреЭДО", ТекущиеДанные.МеткаВремениВЦентреЭДО);
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.СостоянияСинхронизацииОбъектовСЦентромЭДО.ФормаЗаписи",
		ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Подключаемый_СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ИдентификаторЭДО = "";
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ПустаяСсылка();
	
	ПолеИдентификаторЭДО = Новый ПолеКомпоновкиДанных("ИдентификаторЭДО");
	ПолеТипДанных = Новый ПолеКомпоновкиДанных("ТипДанных");
	
	Для Каждого ЭлементОтбора Из Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеИдентификаторЭДО Тогда
			ИдентификаторЭДО = ЭлементОтбора.ПравоеЗначение;
		ИначеЕсли ЭлементОтбора.ЛевоеЗначение = ПолеТипДанных Тогда
			ТипДанных = ЭлементОтбора.ПравоеЗначение;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЭДО)Тогда
		СообщитьПользователюОбОшибкеПолученияДанныхИзСервиса(
			НСтр("ru = 'Не установлен отбор по идентификатору ЭДО'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипДанных)Тогда
		СообщитьПользователюОбОшибкеПолученияДанныхИзСервиса(
			 НСтр("ru = 'Не установлен отбор по типу данных синхронизации'"));
		Возврат;
	КонецЕсли;
	
	ИдентификаторыОбъектов = Новый Массив; // Массив из Строка
	ЗначенияСтрокПоИдентификаторамОбъектов = Новый Соответствие;
	
	Для Каждого СтрокаСписка Из Строки Цикл
		ДанныеСтроки = СтрокаСписка.Значение.Данные;
		ИдентификаторыОбъектов.Добавить(ДанныеСтроки.ИдентификаторОбъекта);
		ЗначенияСтрокПоИдентификаторамОбъектов.Вставить(ДанныеСтроки.ИдентификаторОбъекта, СтрокаСписка.Значение);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ИдентификаторыОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяЗаписьЦентраЭДО = РегистрыСведений.НастройкиИнтеграцииЦентраЭДО.УчетнаяЗаписьЦентраЭДО(ИдентификаторЭДО);
	
	Если ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО Тогда
		МеткиВремениОбъектов = МеткиВремениДокументовЭДОВСервисе(УчетнаяЗаписьЦентраЭДО, ИдентификаторыОбъектов);
	ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО Тогда
		МеткиВремениОбъектов = МеткиВремениПолныхДанныхДокументовЭДОВСервисе(
			УчетнаяЗаписьЦентраЭДО, ИдентификаторыОбъектов);
	ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО Тогда
		МеткиВремениОбъектов = МеткиВремениПриглашенийЭДОВСервисе(УчетнаяЗаписьЦентраЭДО, ИдентификаторыОбъектов);
	ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.УчетныеЗаписиЭДО Тогда
		МеткиВремениОбъектов = МеткиВремениУчетныхЗаписейЭДОСервисе(УчетнаяЗаписьЦентраЭДО, ИдентификаторыОбъектов);
	Иначе
		СообщитьПользователюОбОшибкеПолученияДанныхИзСервиса(СтрШаблон(
			НСтр("ru = 'Для типа синхронизации ""%1"" получение данных из центра ЭДО не поддерживается.'"), ТипДанных));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МеткиВремениОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого МеткаВремениОбъекта Из МеткиВремениОбъектов Цикл
		
		ИдентификаторОбъекта = МеткаВремениОбъекта.Ключ;
		МеткаВремени = МеткаВремениОбъекта.Значение;
		
		ЗначениеСтроки = ЗначенияСтрокПоИдентификаторамОбъектов[ИдентификаторОбъекта]; // СтрокаДинамическогоСписка
		Если ЗначениеСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСтроки = ЗначениеСтроки.Данные;
		ДанныеСтроки.МеткаВремениВЦентреЭДО = МеткаВремени;
		
		ОформлениеЯчейки = ЗначениеСтроки.Оформление["МеткаВремениВЦентреЭДО"];
		ПредставлениеМеткиВремени = ОбщегоНазначенияБЭДКлиентСервер.ПредставлениеДатыВМиллисекундах(МеткаВремени);
		ОформлениеЯчейки.УстановитьЗначениеПараметра("Текст", ПредставлениеМеткиВремени);
		
		Если ДанныеСтроки.МеткаВремени <> ДанныеСтроки.МеткаВремениВЦентреЭДО Тогда
			ОформлениеЯчейки = ЗначениеСтроки.Оформление["МеткаВремени"];
			ОформлениеЯчейки.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаВниманиеБЭД);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьИзОблака(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если Не ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ПолучитьИзОблакаВФоне(ВыделенныеСтроки, УникальныйИдентификатор);
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьИзОблакаЗавершение", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкаФормы

// Параметры:
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
&НаСервере
Процедура УстановитьЗаголовокПоТипуДанных(ТипДанных)
	
	Если ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО Тогда
		Заголовок = НСтр("ru = 'Состояние синхронизации документов ЭДО'");
	ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО Тогда
		Заголовок = НСтр("ru = 'Состояние синхронизации полных данных документов ЭДО'");
	ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО Тогда
		Заголовок = НСтр("ru = 'Состояние синхронизации приглашений ЭДО'");
	ИначеЕсли ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.УчетныеЗаписиЭДО Тогда
		Заголовок = НСтр("ru = 'Состояние синхронизации учетных записей ЭДО'");
	Иначе
		Возврат;
	КонецЕсли;
	
	АвтоЗаголовок = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СписокПриПолученииДанных

// Параметры:
//  ТекстОшибки - Строка
&НаСервереБезКонтекста
Процедура СообщитьПользователюОбОшибкеПолученияДанныхИзСервиса(ТекстОшибки)
	
	ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось выполнить получение данных из центра ЭДО.'")
		+ Символы.ПС + ТекстОшибки);
	
КонецПроцедуры

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - Число
&НаСервереБезКонтекста
Функция МеткиВремениДокументовЭДОВСервисе(УчетнаяЗаписьЦентраЭДО, ИдентификаторыДокументовЭДО)
	
	Результат = Новый Соответствие;
	
	ПараметрыВыполнения = ИнтеграцияЦентраЭДО.ПараметрыВыполненияМетодаСервиса(УчетнаяЗаписьЦентраЭДО);
	
	ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса(
		"МеткиВремениДокументовЭДО", ИдентификаторыДокументовЭДО);
	
	МеткиВремениДокументовЭДОВФорматеСервиса = ИнтеграцияЦентраЭДО.ВыполнитьМетодСервиса(
		ПараметрыВыполнения, ОписаниеМетода); // См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.МеткиВремениДокументовЭДО
	
	Если Не ЗначениеЗаполнено(МеткиВремениДокументовЭДОВФорматеСервиса) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого МеткаВремениДокументаЭДОВФорматеСервиса Из МеткиВремениДокументовЭДОВФорматеСервиса Цикл
		Результат.Вставить(МеткаВремениДокументаЭДОВФорматеСервиса.ИдентификаторДокументаЭДО,
			МеткаВремениДокументаЭДОВФорматеСервиса.МеткаВремени);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - Число
&НаСервереБезКонтекста
Функция МеткиВремениПолныхДанныхДокументовЭДОВСервисе(УчетнаяЗаписьЦентраЭДО, ИдентификаторыДокументовЭДО)
	
	Результат = Новый Соответствие;
	
	ПараметрыВыполнения = ИнтеграцияЦентраЭДО.ПараметрыВыполненияМетодаСервиса(УчетнаяЗаписьЦентраЭДО);
	
	ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса(
		"МеткиВремениПолныхДанныхДокументовЭДО", ИдентификаторыДокументовЭДО);
	
	МеткиВремениДокументовЭДОВФорматеСервиса = ИнтеграцияЦентраЭДО.ВыполнитьМетодСервиса(
		ПараметрыВыполнения, ОписаниеМетода); // См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.МеткиВремениПолныхДанныхДокументовЭДО
	
	Если Не ЗначениеЗаполнено(МеткиВремениДокументовЭДОВФорматеСервиса) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого МеткаВремениДокументаЭДОВФорматеСервиса Из МеткиВремениДокументовЭДОВФорматеСервиса Цикл
		Результат.Вставить(МеткаВремениДокументаЭДОВФорматеСервиса.ИдентификаторДокументаЭДО,
			МеткаВремениДокументаЭДОВФорматеСервиса.МеткаВремени);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  ИдентификаторыПриглашенийЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - Число
&НаСервереБезКонтекста
Функция МеткиВремениПриглашенийЭДОВСервисе(УчетнаяЗаписьЦентраЭДО, ИдентификаторыПриглашенийЭДО)
	
	Результат = Новый Соответствие;
	
	ПараметрыВыполнения = ИнтеграцияЦентраЭДО.ПараметрыВыполненияМетодаСервиса(УчетнаяЗаписьЦентраЭДО);
	
	ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса(
		"МеткиВремениПриглашенийЭДО", ИдентификаторыПриглашенийЭДО);
	
	МеткиВремениПриглашенийЭДОВФорматеСервиса = ИнтеграцияЦентраЭДО.ВыполнитьМетодСервиса(
		ПараметрыВыполнения, ОписаниеМетода); // См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.МеткиВремениПриглашенийЭДО
	
	Если Не ЗначениеЗаполнено(МеткиВремениПриглашенийЭДОВФорматеСервиса) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого МеткаВремениПриглашенияЭДОВФорматеСервиса Из МеткиВремениПриглашенийЭДОВФорматеСервиса Цикл
		Результат.Вставить(МеткаВремениПриглашенияЭДОВФорматеСервиса.ИдентификаторПриглашенияЭДО,
			МеткаВремениПриглашенияЭДОВФорматеСервиса.МеткаВремени);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - Число
&НаСервереБезКонтекста
Функция МеткиВремениУчетныхЗаписейЭДОСервисе(УчетнаяЗаписьЦентраЭДО, ИдентификаторыДокументовЭДО)
	
	Результат = Новый Соответствие;
	
	ПараметрыВыполнения = ИнтеграцияЦентраЭДО.ПараметрыВыполненияМетодаСервиса(УчетнаяЗаписьЦентраЭДО);
	
	ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса(
		"МеткиВремениУчетныхЗаписейЭДО", ИдентификаторыДокументовЭДО);
	
	МеткиВремениУчетныхЗаписейЭДОВФорматеСервиса = ИнтеграцияЦентраЭДО.ВыполнитьМетодСервиса(
		ПараметрыВыполнения, ОписаниеМетода); // См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.МеткиВремениУчетныхЗаписейЭДО
	
	Если Не ЗначениеЗаполнено(МеткиВремениУчетныхЗаписейЭДОВФорматеСервиса) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого МеткаВремениУчетнойЗаписиЭДОВФорматеСервиса Из МеткиВремениУчетныхЗаписейЭДОВФорматеСервиса Цикл
		Результат.Вставить(МеткаВремениУчетнойЗаписиЭДОВФорматеСервиса.ИдентификаторЭДО,
			МеткаВремениУчетнойЗаписиЭДОВФорматеСервиса.МеткаВремени);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПолучитьИзОблака

// Параметры:
//  ОбъектыДляСинхронизации - Массив из РегистрСведенийКлючЗаписи.СостоянияСинхронизацииОбъектовСЦентромЭДО
//  ИдентификаторФормы - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  - Неопределено
//  - См. ДлительныеОперации.ВыполнитьФункцию
&НаСервереБезКонтекста
Функция ПолучитьИзОблакаВФоне(Знач ОбъектыДляСинхронизации, Знач ИдентификаторФормы)
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"РегистрыСведений.СостоянияСинхронизацииОбъектовСЦентромЭДО.ПолучитьОбъектыИзСервиса",
		ОбъектыДляСинхронизации);
	
КонецФункции

// Параметры:
//  ДлительнаяОперация - см. ДлительныеОперации.ВыполнитьФункцию
//  Контекст - Неопределено
&НаКлиенте
Процедура ПолучитьИзОблакаЗавершение(ДлительнаяОперация, Контекст = Неопределено) Экспорт
	
	ВидОперации = НСтр("ru = 'Получение объектов из облака'");
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	
	РезультатПолучения = ОбщегоНазначенияБЭДКлиент.РезультатВыполненияФоновогоЗадания(
		ВидОперации, ДлительнаяОперация, КонтекстДиагностики); // См. РегистрыСведений.СостоянияСинхронизацииОбъектовСЦентромЭДО.ПолучитьОбъектыИзСервиса
	
	Если Не ЗначениеЗаполнено(РезультатПолучения) Тогда
		ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики);
		Возврат;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(РезультатПолучения.КонтекстДиагностики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
